zephyrproject-rtos/hal_nxp/dts/nxp/mcx/mcxn/pinctrl/MCXN236VDF-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MCXN236VDF/signal_configuration.xml
 *
 * 
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on MCXN947VDF-pinctrl.h with this part's differences applied
 * below (339 removed, 0 changed,
 * 10 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 5c1d4a3d156c0945
 */

#ifndef _ZEPHYR_DTS_BINDING_MCXN236VDF_WRAPPER_
#define _ZEPHYR_DTS_BINDING_MCXN236VDF_WRAPPER_

#include "MCXN947VDF-pinctrl.h"

/* Signals not present on this part */
#undef ADC0_B10_PIO0_10
#undef ADC0_B11_PIO0_11
#undef ADC0_B12_PIO0_12
#undef ADC0_B13_PIO0_13
#undef ADC0_B22_PIO0_30
#undef ADC0_B23_PIO0_31
#undef ADC0_B8_PIO0_8
#undef ADC0_B9_PIO0_9
#undef ADC1_A20_PIO1_20
#undef ADC1_A21_PIO1_21
#undef ADC1_A22_PIO1_22
#undef ADC1_A23_PIO1_23
#undef ADC1_B16_PIO5_8
#undef ADC1_B17_PIO5_9
#undef CAN1_RXD_PIO1_21
#undef CAN1_TXD_PIO1_20
#undef CMP1_IN3_PIO1_20
#undef CMP2_IN0_PIO1_2
#undef CMP2_IN1_PIO0_7
#undef CMP2_IN2_PIO0_23
#undef CMP2_IN3_PIO1_21
#undef CMP2_IN4N_PIO4_2
#undef CMP2_IN4P_PIO4_23
#undef CMP2_IN5N_PIO4_3
#undef CT0_MAT0_PIO0_10
#undef CT0_MAT1_PIO0_11
#undef CT0_MAT2_PIO0_12
#undef CT0_MAT3_PIO0_13
#undef CT2_MAT1_PIO3_19
#undef CT3_MAT2_PIO1_20
#undef CT3_MAT3_PIO1_21
#undef CT4_MAT1_PIO3_3
#undef CT_INP0_PIO0_8
#undef CT_INP14_PIO1_22
#undef CT_INP15_PIO1_23
#undef CT_INP18_PIO3_4
#undef CT_INP19_PIO3_5
#undef CT_INP1_PIO0_9
#undef CT_INP2_PIO0_30
#undef CT_INP3_PIO0_31
#undef DAC0_OUT_PIO4_2
#undef DAC1_OUT_PIO4_3
#undef ENET0_COL_PIO1_18
#undef ENET0_CRS_PIO1_19
#undef ENET0_MDC_PIO1_2
#undef ENET0_MDC_PIO1_20
#undef ENET0_MDIO_PIO1_21
#undef ENET0_MDIO_PIO1_3
#undef ENET0_RXD0_PIO1_14
#undef ENET0_RXD1_PIO1_15
#undef ENET0_RXD2_PIO1_16
#undef ENET0_RXD3_PIO1_17
#undef ENET0_RXDV_PIO1_13
#undef ENET0_RXER_PIO1_12
#undef ENET0_RX_CLK_PIO1_11
#undef ENET0_TXD0_PIO1_6
#undef ENET0_TXD1_PIO1_7
#undef ENET0_TXD2_PIO1_8
#undef ENET0_TXD3_PIO1_9
#undef ENET0_TXEN_PIO1_5
#undef ENET0_TXER_PIO1_10
#undef ENET0_TX_CLK_PIO1_4
#undef FC0_P0_PIO0_12
#undef FC0_P1_PIO0_13
#undef FC0_P4_PIO0_8
#undef FC0_P5_PIO0_9
#undef FC0_P6_PIO0_10
#undef FC0_P6_PIO0_30
#undef FC1_P4_PIO0_12
#undef FC1_P5_PIO0_13
#undef FC1_P6_PIO0_30
#undef FC4_P0_PIO1_20
#undef FC4_P1_PIO1_21
#undef FC4_P2_PIO1_22
#undef FC4_P3_PIO1_23
#undef FC5_P4_PIO1_20
#undef FC5_P5_PIO1_21
#undef FC5_P6_PIO1_22
#undef FC7_P1_PIO3_3
#undef FC7_P2_PIO3_4
#undef FC7_P3_PIO3_5
#undef FC7_P6_PIO3_19
#undef FC8_P0_PIO3_14
#undef FC8_P1_PIO3_15
#undef FC8_P2_PIO3_16
#undef FC8_P3_PIO3_17
#undef FC8_P4_PIO3_20
#undef FC8_P5_PIO3_21
#undef FC8_P6_PIO3_22
#undef FC9_P0_PIO2_4
#undef FC9_P1_PIO2_3
#undef FC9_P2_PIO2_5
#undef FC9_P3_PIO2_2
#undef FC9_P4_PIO2_6
#undef FC9_P5_PIO2_7
#undef FC9_P6_PIO2_0
#undef FLEXIO0_D0_PIO0_8
#undef FLEXIO0_D11_PIO3_3
#undef FLEXIO0_D12_PIO3_4
#undef FLEXIO0_D13_PIO3_5
#undef FLEXIO0_D1_PIO0_9
#undef FLEXIO0_D27_PIO3_19
#undef FLEXIO0_D28_PIO1_20
#undef FLEXIO0_D29_PIO1_21
#undef FLEXIO0_D2_PIO0_10
#undef FLEXIO0_D30_PIO1_22
#undef FLEXIO0_D31_PIO1_23
#undef FLEXIO0_D3_PIO0_11
#undef FLEXIO0_D4_PIO0_12
#undef FLEXIO0_D5_PIO0_13
#undef FLEXSPI0_A_DATA0_PIO3_8
#undef FLEXSPI0_A_DATA1_PIO3_9
#undef FLEXSPI0_A_DATA2_PIO3_10
#undef FLEXSPI0_A_DATA3_PIO3_11
#undef FLEXSPI0_A_DATA4_PIO3_12
#undef FLEXSPI0_A_DATA5_PIO3_13
#undef FLEXSPI0_A_DATA6_PIO3_14
#undef FLEXSPI0_A_DATA7_PIO3_15
#undef FLEXSPI0_A_DQS_PIO3_6
#undef FLEXSPI0_A_SCLK_PIO3_7
#undef FLEXSPI0_A_SS0_b_PIO3_0
#undef FLEXSPI0_A_SS1_b_PIO3_1
#undef FLEXSPI0_B_DATA0_PIO2_4
#undef FLEXSPI0_B_DATA1_PIO2_5
#undef FLEXSPI0_B_DATA2_PIO2_6
#undef FLEXSPI0_B_DATA3_PIO2_7
#undef FLEXSPI0_B_DATA4_PIO2_8
#undef FLEXSPI0_B_DATA5_PIO2_9
#undef FLEXSPI0_B_DATA6_PIO2_10
#undef FLEXSPI0_B_DATA7_PIO2_11
#undef FLEXSPI0_B_DQS_PIO2_1
#undef FLEXSPI0_B_SCLK_PIO2_3
#undef FLEXSPI0_B_SS0_b_PIO2_2
#undef FLEXSPI0_B_SS1_b_PIO2_0
#undef HSCMP2_OUT_PIO0_11
#undef HSCMP2_OUT_PIO0_6
#undef OPAMP0_INP0_PIO4_12
#undef OPAMP0_INP1_PIO4_13
#undef OPAMP0_OUT_PIO4_15
#undef OPAMP1_INP0_PIO4_16
#undef OPAMP1_INP1_PIO4_17
#undef OPAMP1_OUT_PIO4_19
#undef OPAMP2_INP0_PIO4_20
#undef OPAMP2_INP1_PIO4_21
#undef OPAMP2_OUT_PIO4_23
#undef PF_QSPI_CS0_DIS_PIO3_0
#undef PF_QSPI_CS1_DIS_PIO3_1
#undef PF_QSPI_CS_n_PIO3_6
#undef PF_QSPI_DATA0_PIO3_8
#undef PF_QSPI_DATA1_PIO3_9
#undef PF_QSPI_DATA2_PIO3_10
#undef PF_QSPI_DATA3_PIO3_11
#undef PF_QSPI_SCKIN_PIO3_7
#undef PF_SPI_CS0_DIS_n_PIO3_20
#undef PF_SPI_CS0_n_PIO3_13
#undef PF_SPI_CS1_DIS_n_PIO3_21
#undef PF_SPI_DATA_PIO3_14
#undef PF_SPI_SCKIN_PIO3_15
#undef PIO0_10
#undef PIO0_11
#undef PIO0_12
#undef PIO0_13
#undef PIO0_30
#undef PIO0_31
#undef PIO0_8
#undef PIO0_9
#undef PIO1_20
#undef PIO1_21
#undef PIO1_22
#undef PIO1_23
#undef PIO3_19
#undef PIO3_3
#undef PIO3_4
#undef PIO3_5
#undef PIO5_8
#undef PIO5_9
#undef PLU_CLK_PIO1_7
#undef PLU_CLK_PIO4_6
#undef PLU_IN0_PIO1_10
#undef PLU_IN0_PIO4_0
#undef PLU_IN1_PIO1_11
#undef PLU_IN1_PIO4_1
#undef PLU_IN2_PIO1_14
#undef PLU_IN2_PIO4_2
#undef PLU_IN3_PIO1_15
#undef PLU_IN3_PIO4_3
#undef PLU_IN4_PIO1_18
#undef PLU_IN4_PIO4_4
#undef PLU_IN5_PIO1_19
#undef PLU_IN5_PIO4_5
#undef PLU_OUT0_PIO1_8
#undef PLU_OUT0_PIO4_12
#undef PLU_OUT1_PIO1_9
#undef PLU_OUT1_PIO4_13
#undef PLU_OUT2_PIO1_12
#undef PLU_OUT2_PIO4_14
#undef PLU_OUT3_PIO1_13
#undef PLU_OUT3_PIO4_15
#undef PLU_OUT4_PIO1_16
#undef PLU_OUT4_PIO4_16
#undef PLU_OUT5_PIO1_17
#undef PLU_OUT5_PIO4_17
#undef PLU_OUT6_PIO1_20
#undef PLU_OUT6_PIO4_18
#undef PLU_OUT7_PIO1_21
#undef PLU_OUT7_PIO4_19
#undef PWM0_X1_PIO3_3
#undef PWM0_X2_PIO3_4
#undef PWM0_X3_PIO3_5
#undef PWM1_X1_PIO3_19
#undef SAI1_MCLK_PIO1_21
#undef SAI1_RX_FS_PIO3_19
#undef SCT0_IN0_PIO1_6
#undef SCT0_IN0_PIO2_0
#undef SCT0_IN1_PIO1_7
#undef SCT0_IN1_PIO2_1
#undef SCT0_IN2_PIO1_10
#undef SCT0_IN2_PIO2_8
#undef SCT0_IN3_PIO1_11
#undef SCT0_IN3_PIO2_9
#undef SCT0_IN4_PIO1_14
#undef SCT0_IN4_PIO2_10
#undef SCT0_IN5_PIO1_15
#undef SCT0_IN5_PIO2_11
#undef SCT0_IN6_PIO1_18
#undef SCT0_IN6_PIO1_2
#undef SCT0_IN7_PIO1_19
#undef SCT0_IN7_PIO1_3
#undef SCT0_OUT0_PIO1_4
#undef SCT0_OUT0_PIO2_2
#undef SCT0_OUT1_PIO1_5
#undef SCT0_OUT1_PIO2_3
#undef SCT0_OUT2_PIO1_8
#undef SCT0_OUT2_PIO2_4
#undef SCT0_OUT3_PIO1_9
#undef SCT0_OUT3_PIO2_5
#undef SCT0_OUT4_PIO1_12
#undef SCT0_OUT4_PIO1_22
#undef SCT0_OUT4_PIO2_6
#undef SCT0_OUT5_PIO1_13
#undef SCT0_OUT5_PIO1_23
#undef SCT0_OUT5_PIO2_7
#undef SCT0_OUT6_PIO1_0
#undef SCT0_OUT6_PIO1_16
#undef SCT0_OUT7_PIO1_1
#undef SCT0_OUT7_PIO1_17
#undef SCT0_OUT8_PIO1_20
#undef SCT0_OUT8_PIO1_30
#undef SCT0_OUT9_PIO1_21
#undef SCT0_OUT9_PIO1_31
#undef SDHC0_CLK_PIO2_4
#undef SDHC0_CMD_PIO2_5
#undef SDHC0_D0_PIO2_3
#undef SDHC0_D1_PIO2_2
#undef SDHC0_D2_PIO2_7
#undef SDHC0_D3_PIO2_6
#undef SDHC0_D4_PIO2_1
#undef SDHC0_D5_PIO2_0
#undef SDHC0_D6_PIO2_9
#undef SDHC0_D7_PIO2_8
#undef SIM0_CLK_PIO3_10
#undef SIM0_CLK_PIO3_16
#undef SIM0_IO_PIO3_11
#undef SIM0_IO_PIO3_17
#undef SIM0_PD_PIO3_20
#undef SIM0_PD_PIO3_8
#undef SIM0_RST_PIO3_21
#undef SIM0_RST_PIO3_9
#undef SIM0_VCCEN_PIO3_22
#undef SIM0_VCCEN_PIO3_7
#undef SIM1_CLK_PIO3_4
#undef SIM1_IO_PIO3_5
#undef SIM1_PD_PIO3_2
#undef SIM1_RST_PIO3_3
#undef SIM1_VCCEN_PIO3_6
#undef SINC0_MBIT0_PIO2_3
#undef SINC0_MBIT0_PIO4_13
#undef SINC0_MBIT1_PIO2_5
#undef SINC0_MBIT1_PIO4_17
#undef SINC0_MBIT2_PIO2_7
#undef SINC0_MBIT2_PIO4_21
#undef SINC0_MBIT3_PIO2_9
#undef SINC0_MBIT3_PIO4_2
#undef SINC0_MBIT4_PIO2_11
#undef SINC0_MBIT4_PIO4_5
#undef SINC0_MCLK0_PIO2_2
#undef SINC0_MCLK0_PIO4_12
#undef SINC0_MCLK1_PIO2_4
#undef SINC0_MCLK1_PIO4_16
#undef SINC0_MCLK2_PIO2_6
#undef SINC0_MCLK2_PIO4_20
#undef SINC0_MCLK3_PIO2_8
#undef SINC0_MCLK3_PIO4_0
#undef SINC0_MCLK4_PIO2_10
#undef SINC0_MCLK4_PIO4_4
#undef SINC0_MCLK_OUT0_PIO2_1
#undef SINC0_MCLK_OUT0_PIO4_15
#undef SINC0_MCLK_OUT1_PIO4_19
#undef SINC0_MCLK_OUT2_PIO4_23
#undef SMARTDMA_PIO16_PIO1_20
#undef SMARTDMA_PIO17_PIO1_21
#undef SMARTDMA_PIO18_PIO1_22
#undef SMARTDMA_PIO19_PIO1_23
#undef SMARTDMA_PIO19_PIO3_19
#undef SMARTDMA_PIO3_PIO3_3
#undef SMARTDMA_PIO4_PIO3_4
#undef SMARTDMA_PIO5_PIO3_5
#undef TAMPER6_PIO5_8
#undef TAMPER7_PIO5_9
#undef TRIG_IN2_PIO1_20
#undef TRIG_IN3_PIO1_22
#undef TRIG_OUT2_PIO1_21
#undef TRIG_OUT7_PIO5_8
#undef TSI0_CH0_PIO1_0
#undef TSI0_CH10_PIO0_6
#undef TSI0_CH11_PIO0_16
#undef TSI0_CH12_PIO0_17
#undef TSI0_CH13_PIO0_18
#undef TSI0_CH14_PIO0_19
#undef TSI0_CH15_PIO0_20
#undef TSI0_CH16_PIO0_21
#undef TSI0_CH17_PIO1_8
#undef TSI0_CH18_PIO1_9
#undef TSI0_CH19_PIO1_10
#undef TSI0_CH1_PIO1_1
#undef TSI0_CH20_PIO1_11
#undef TSI0_CH21_PIO1_12
#undef TSI0_CH22_PIO1_13
#undef TSI0_CH23_PIO1_14
#undef TSI0_CH24_PIO1_15
#undef TSI0_CH2_PIO1_2
#undef TSI0_CH3_PIO1_3
#undef TSI0_CH4_PIO1_4
#undef TSI0_CH5_PIO1_5
#undef TSI0_CH6_PIO1_6
#undef TSI0_CH7_PIO1_7
#undef TSI0_CH8_PIO0_4
#undef TSI0_CH9_PIO0_5
#undef USB0_VBUS_DET_PIO4_12

/* Signals specific to this part */
#define ADC0_A0_PIO4_0 N9X_MUX('4',0,0)
#define ADC0_A3_PIO4_6 N9X_MUX('4',6,0)
#define ADC0_B0_PIO4_1 N9X_MUX('4',1,0)
#define ADC1_A0_PIO4_4 N9X_MUX('4',4,0)
#define ADC1_A3_PIO4_6 N9X_MUX('4',6,0)
#define ADC1_B0_PIO4_5 N9X_MUX('4',5,0)
#define CLKOUT_PIO0_6 N9X_MUX('0',6,12)
#define FREQME_CLK_OUT0_PIO3_1 N9X_MUX('3',1,12)
#define FREQME_CLK_OUT1_PIO3_6 N9X_MUX('3',6,12)
#define USB1_OTG_ID_PIO4_13 N9X_MUX('4',13,3)

#endif /* _ZEPHYR_DTS_BINDING_MCXN236VDF_WRAPPER_ */
